# GetProfile Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetProfile Method
FabricationConfiguration Class See Also
---
Return the profile of the loaded fabrication configuration. Return empty string for global profile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string GetProfile()
```

Visual Basic
---
```text
Public Function GetProfile As String
```

Visual C++
---
```text
public:
String^ GetProfile()
```

# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace